
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 3 to change, 2 to destroy.</code></pre>

* Create
  * module.ccpay-bulkscanning-payment-database-v15.terraform_data.trigger_password_reset
* Update
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription
  * azurerm_api_management_subscription.iron_mountain_supplier_subscription
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.exela_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/6dba11e4-d5da-4ca9-ba42-0a965df14a53"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_bulk_scan_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/d76fb7ae-abfe-438c-a7d3-d74764ca08b4"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.iron_mountain_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "iron_mountain_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/259cde55-4006-4fd2-b534-416522123483"
        # (10 unchanged attributes hidden)
    }

  # module.ccpay-bulkscanning-payment-database-v15.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name/0d9f3329d1b646538368a22aa1a046d8" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name/versions/0d9f3329d1b646538368a22aa1a046d8" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "0d9f3329d1b646538368a22aa1a046d8" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password/49229c372eae47609bcaf6ba2bb3e1ec" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password/versions/49229c372eae47609bcaf6ba2bb3e1ec" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "49229c372eae47609bcaf6ba2bb3e1ec" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":554,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->